{
  "model_max_length": 1048576,
  "tokenizer_class": "HYTokenizer",
  "auto_map": {
    "AutoTokenizer": ["tokenization_hy.HYTokenizer", "null"]
  },
  "additional_special_tokens": [
    "<|startoftext|>",
    "<|endoftext|>",
    "<|bos|>",
    "<|eos|>",
    "<|pad|>",
    "<|extra_0|>",
    "<|extra_4|>",
    "<|extra_5|>"
  ],
  "bos_token": "<|startoftext|>",
  "eos_token": "<|endoftext|>",
  "pad_token": "<|pad|>",
  "chat_template": "{% for message in messages %}{% if message['role'] == 'user' %}{% if not loop.first %}<|startoftext|>{% endif %}{{ message['content'] }}<|extra_0|><|endoftext|>{% elif message['role'] == 'assistant' %}{{ message['content'] }}<|eos|><|endoftext|>{% endif %}{% endfor %}"
}
